app/controllers/authors_controller.rb

SELECT * FROM "authors" ORDER BY name DESC
---
  def index
    @authors = Author.all(:order => "name ASC")

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES('aassa', '2010-06-29 03:33:23', '2010-06-29 03:33:23')
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
UPDATE "authors" SET "updated_at" = '2010-06-29 03:27:45', "name" = 'Bryan Mikaelian333' WHERE "id" = 1
---
  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])

SELECT * FROM "authors" WHERE ("authors"."id" = 3)
DELETE FROM "authors" WHERE "id" = 3
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy