app/controllers/blogs_controller.rb

SELECT * FROM "blogs" ORDER BY created_at DESC
---
  def index
    @blogs = Blog.all(:order => "created_at DESC")

SELECT * FROM "blogs" WHERE ("blogs"."id" = 5)
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("name", "created_at", "post", "updated_at", "author_id") VALUES('aaa', '2010-06-28 01:26:05', '', '2010-06-28 01:26:05', NULL)
---
  def create
    @blog = Blog.new(params[:blog])

    respond_to do |format|
      if @blog.save

SELECT * FROM "blogs" WHERE ("blogs"."id" = 5)
UPDATE "blogs" SET "updated_at" = '2010-07-22 21:12:48', "post" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Donec sagittis dolor nec diam semper blandit. Pellentesque egestas volutpat nisl, commodo varius lorem aliquet eu. Duis cursus nunc semper turpis tincidunt congue. Aenean a mauris eget nisi posuere..
---
  def update
    @blog = Blog.find(params[:id])

    respond_to do |format|
      if @blog.update_attributes(params[:blog])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 3)
DELETE FROM "blogs" WHERE "id" = 3
---
  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy